# Faster R-CNN ResNet50 Configuration for TensorFlow Object Detection API
# This configuration provides better accuracy but requires more computational resources

model {
  faster_rcnn {
    num_classes: 1  # Update this to match your number of classes
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 600
        max_dimension: 1024
      }
    }
    feature_extractor {
      type: "faster_rcnn_resnet50_keras"
      batch_norm_trainable: true
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_atrous_rate: 1
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        share_box_across_classes: false
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
        use_static_shapes: false
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    use_static_shapes: false
    use_matmul_crop_and_resize: false
    clip_anchors_to_image: true
    use_static_balanced_label_sampler: false
    use_matmul_gather_in_matcher: false
    use_static_shapes: false
    use_matmul_crop_and_resize: false
    clip_anchors_to_image: true
    use_static_balanced_label_sampler: false
    use_matmul_gather_in_matcher: false
  }
}

train_config {
  batch_size: 1  # Adjust based on your GPU memory
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_rotation90 {
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0003000000142492354
          schedule {
            step: 900000
            learning_rate: .00003000000142492354
          }
          schedule {
            step: 1200000
            learning_rate: .000003000000142492354
          }
        }
      }
      momentum_optimizer_value: 0.8999999761581421
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "PATH_TO_BE_CONFIGURED"  # Update this path
  num_steps: 200000  # Adjust based on your dataset size
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "classification"
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}

train_input_reader {
  label_map_path: "PATH_TO_BE_CONFIGURED"  # Update this path
  tf_record_input_reader {
    input_path: "PATH_TO_BE_CONFIGURED"  # Update this path
  }
}

eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  eval_interval_secs: 600  # Evaluate every 10 minutes
  max_evals: 0
  save_graph: false
  visualization_export_dir: "PATH_TO_BE_CONFIGURED"  # Update this path
  num_visualizations: 10
  num_examples: 1000
  eval_master: ""
  batch_size: 1
  include_metrics_per_category: true
  max_num_boxes_to_visualize: 20
  min_score_threshold: 0.2
  num_keypoints: 0
  skip_scores: false
  skip_labels: false
  skip_tp: false
  use_groundtruth_in_eval: false
}

eval_input_reader {
  label_map_path: "PATH_TO_BE_CONFIGURED"  # Update this path
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "PATH_TO_BE_CONFIGURED"  # Update this path
  }
}
